003/memo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org76644e7">No.101</a></li>
<li><a href="#orga00f50b">No.102</a></li>
<li><a href="#org7454e0d">No.103</a></li>
<li><a href="#orgda7c461">No.104</a></li>
<li><a href="#orgfb9e3d3">No.105</a></li>
<li><a href="#orgeaded64">No.106</a></li>
<li><a href="#org4222816">No.107</a></li>
<li><a href="#org44a0d78">No.108</a></li>
<li><a href="#orgd98708e">No.110</a></li>
<li><a href="#org11d1482">No.111</a></li>
<li><a href="#org46e0b12">No.112</a></li>
<li><a href="#org404ad69">No.115</a></li>
<li><a href="#orgf657b19">No.116</a></li>
<li><a href="#orgc6fca82">No.117</a></li>
<li><a href="#org135be8b">No.118</a></li>
</ul>
</div>
</div>

<div id="outline-container-org76644e7" class="outline-2">
<h2 id="org76644e7">No.101</h2>
<div class="outline-text-2" id="text-org76644e7">
<p>
\(i\) 番目からスタートしたときのゴール番号をシミュレーションで計算する。
</p>

<p>
\(i\) 番目からスタートしたときにあみだくじをいくつつなげれば再び \(i\) 番目に戻るかを計算する。
</p>

<p>
\(1 \cdots N\) 番目の必要なあみだくじの数の最小公倍数が答えである。
</p>
</div>
</div>

<div id="outline-container-orga00f50b" class="outline-2">
<h2 id="orga00f50b">No.102</h2>
<div class="outline-text-2" id="text-orga00f50b">
<p>
最後の山の最後のカードを取ると、相手のカードを少なくとも半分以上奪えるので、最後の山の最後のカードを取った人の勝ちである。
</p>

<p>
あとは grundy 数を計算すればいい。
</p>
</div>
</div>

<div id="outline-container-org7454e0d" class="outline-2">
<h2 id="org7454e0d">No.103</h2>
<div class="outline-text-2" id="text-org7454e0d">
<p>
素因数の乗数をカードの枚数と考えれば No.102 とほぼ同様の問題となる。
</p>
</div>
</div>

<div id="outline-container-orgda7c461" class="outline-2">
<h2 id="orgda7c461">No.104</h2>
<div class="outline-text-2" id="text-orgda7c461">
<p>
\(i\) 号線は左は \(2i\) 号線、右は \(2i+1\) 号線に分岐する。
</p>

<p>
あとはシミュレーションを行う。
</p>
</div>
</div>

<div id="outline-container-orgfb9e3d3" class="outline-2">
<h2 id="orgfb9e3d3">No.105</h2>
<div class="outline-text-2" id="text-orgfb9e3d3">
<p>
角度は \(\tan^{-1}(y/x)\) で求める。(たいていの言語には <code>atan2</code> があると思われる)
</p>

<p>
\(0 \cdots 360^\circ\) の範囲に収まるように調整し、ソートした最初の角度が求める角度である。
</p>

<p>
ただし、誤差の関係で \(50^\circ\) を超えることがあるので、その場合は \(0^\circ\) が答えとなる。
</p>
</div>
</div>

<div id="outline-container-orgeaded64" class="outline-2">
<h2 id="orgeaded64">No.106</h2>
<div class="outline-text-2" id="text-orgeaded64">
<p>
エラトステネスの篩を改造して素因数の数を数えられるようにする。
</p>
</div>
</div>

<div id="outline-container-org4222816" class="outline-2">
<h2 id="org4222816">No.107</h2>
<div class="outline-text-2" id="text-org4222816">
<p>
それまでに相手をしたモンスターの集合 \(S\) として、そのときの取りうる最大体力を \(H(S)\) とする。
</p>

<p>
\(H(S)\) は \(H(S - m_i)\) (ただし \(m_i \in S\)) から求められる。(それまでに相手をしたモンスターの集合からレベルも求められる)
</p>

<p>
最後に \(H(T)\) (\(T\) はすべてのモンスターの集合) を見る。
</p>
</div>
</div>

<div id="outline-container-org44a0d78" class="outline-2">
<h2 id="org44a0d78">No.108</h2>
<div class="outline-text-2" id="text-org44a0d78">
<p>
\(i\) 枚 (\(0 \leq i \leq 2\)) 持っているカードの種類数を \(x_i\) として、このときのコンプリートまで購入するカード枚数の期待値を \(E(x_0, x_1, x_2)\) とすると、
</p>

<p>
\[ E(x_0, x_1, x_2) = E(x_0 - 1, x_1 + 1, x_2) \frac{x_0}{N} + E(x_0, x_1 - 1, x_2 + 1) \frac{x_1}{N} + E(x_0, x_1, x_2 - 1) \frac{x_2}{N} + E(x_0, x_1, x_2) \frac{N - x_s}{N} + 1 \]
</p>

<p>
となる。ただし、 \(x_s = x_0 + x_1 + x_2\) である。これを変形して、
</p>

<p>
\[ E(x_0, x_1, x_2) = (E(x_0 - 1, x_1 + 1, x_2) x_0 + E(x_0, x_1 - 1, x_2 + 1) x_1 + E(x_0, x_1, x_2 - 1) x_2 + N) \frac{1}{x_s} \]
</p>

<p>
となる。ただし、\(E(0, 0, 0) = 0\) である。
</p>

<p>
これをメモ化再帰で計算する。
</p>
</div>
</div>

<div id="outline-container-orgd98708e" class="outline-2">
<h2 id="orgd98708e">No.110</h2>
<div class="outline-text-2" id="text-orgd98708e">
<p>
最初に白を使うとする。このとき、白の最大の長さの棒を使う。次に使う黒の棒は直前の白の長さより短い長さの棒のうちの最大の長さの棒である。以下これを繰り返して何本使えるかを計算する。
</p>

<p>
最初に黒を使う場合も同様に計算し、より大きい高さが答えである。
</p>
</div>
</div>

<div id="outline-container-org11d1482" class="outline-2">
<h2 id="org11d1482">No.111</h2>
<div class="outline-text-2" id="text-org11d1482">
<p>
\(i\) 文字目から始まる回文数 \(S_i\) は、\(k = (L - 1) / 2\) とすると、
</p>

\begin{align*}
S_j &= k - j + 1 & (j = 2i - 1) \\
S_j &= k - j     & (j = 2i)
\end{align*}

<p>
となる。ただし、\(1 \leq j \leq k\) である。よって、すべての回文数は、
</p>

<p>
\[ S = \sum_{j=1}^k S_j = 2k^2 - k(k+1) + k = k^2 \]
</p>

<p>
となる。
</p>
</div>
</div>

<div id="outline-container-org46e0b12" class="outline-2">
<h2 id="org46e0b12">No.112</h2>
<div class="outline-text-2" id="text-org46e0b12">
<p>
\(i\) 番目の動物の足の数を \(b_i\) として、 \(S = \sum b_i\) とすると、
</p>

<p>
\[ a_i = S - b_i \]
</p>

<p>
となる。両辺をすべての \(i\) について足すと、
</p>

<p>
\[ \sum a_i = NS - S = (N-1)S \]
</p>

<p>
となる。ここから \(S\) が求め、\(b_i\) を求める。
</p>
</div>
</div>

<div id="outline-container-org404ad69" class="outline-2">
<h2 id="org404ad69">No.115</h2>
<div class="outline-text-2" id="text-org404ad69">
<p>
最初に \(1, 2, \cdots, K\) 円を買ったとする。これが \(D\) 円以下なら、最後の \(K\) 円のお菓子をより高いお菓子に切り替える。一番高いお菓子に切り替えても \(D\) 円に届いていないならば、\(K-1\) 円のお菓子をより高いお菓子に切り替える。
</p>

<p>
以下これを繰り返す。
</p>
</div>
</div>

<div id="outline-container-orgf657b19" class="outline-2">
<h2 id="orgf657b19">No.116</h2>
<div class="outline-text-2" id="text-orgf657b19">
<p>
実装あるのみ。
</p>
</div>
</div>

<div id="outline-container-orgc6fca82" class="outline-2">
<h2 id="orgc6fca82">No.117</h2>
<div class="outline-text-2" id="text-orgc6fca82">
\begin{align*}
C(n, k) &= \frac{n!}{k!(n-k)!} \\
P(n, k) &= \frac{n!}{(n-k)!} \\
H(n, k) &= C(n+k-1, k) \\
        &= \frac{(n+k-1)!}{k!(n-1)!}
\end{align*}

<p>
である。ここで \(p = 10^9 + 7\) とすると、\(p\) は素数であるので剰余環 \(\mathbb{Z}/p\mathbb{Z}\) の要素には逆元が存在し、その値は拡張ユークリッドの互除法で計算することができる。
</p>

<p>
ここで剰余環 \(\mathbb{Z}/p\mathbb{Z}\) 上で \(n!\) およびその逆元をあらかじめ求めておけば、上記の計算はすべて \(O(1)\) で可能である。
</p>
</div>
</div>

<div id="outline-container-org135be8b" class="outline-2">
<h2 id="org135be8b">No.118</h2>
<div class="outline-text-2" id="text-org135be8b">
<p>
選んだ竹の長さがすべて異なっていればいい。
</p>

<p>
\(N\) 本から \(3\) を選ぶ組み合わせの数は \({}_NC_3\) である。ここから同じ長さの竹を選ぶ組み合わせを差し引く。
</p>

<p>
\(k\) 本同じ長さの竹がある場合、そのうちの \(2\) 本が入っている組み合わせの数は ${}<sub>kC</sub><sub>2</sub> (N-k)$　であり、\(3\) 本が入っている組み合わせの数は \({}_kC_3\) である。
</p>

<p>
\({}_nC_r\) の \(r\) は \(2\) か \(3\) であり、\(N \leq 10^5\) であるから計算はすべて long の範囲で収まる。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
